app/controllers/plans_controller.rb

  def create
    @plan = Plan.new(plan_params)

    if @plan.save
---
INSERT INTO "plans" ("affective_goal", "academic_goal", "task", "measure", "actions", "purpose", "deadline", "created_at", "updated_at", "user_id", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"