app/controllers/users_controller.rb

  def login
    puts '--- LOGIN ---'
    #########NEED TO COMMENT THIS OUT WHEN DONE W/TDD:
    puts username: params[:user][:username]
    puts password: params[:user][:password]

    user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Ginger"], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "oneedited"], ["password_digest", "$2a$10$xuzX3V.GTDLxFJdD/IyBseGxClTiQY3Pjd623AdWh3yTet2yGcCjW"], ["updated_at", "2017-09-17 00:42:58.138233"], ["id", 2]]

  def destroy
    puts 'learner destroying their align account - backend talking'
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]